### Topic: Correlation between Economics and Real Estate


<ul>
<li>College: Mt San Antonio College</li>
<li>Course: CISD41 Introduction to Data Science</li>
<li>by: Alec Phong and Jack Chen</li>
<br>
<br>

### Overview


<ol>
<li>Questions</li>
<li>Importing Data</li>
<li>Functions and Lambda</li>
<li>Cleaning Data</li>
<li>Organizing Data</li>
<li>Data Visualization</li>
<li>Pivot tables</li>
<li>Descriptive Statistics</li>
<ul><li>Mean, median, standard deviation, precentiles, boxplots</li></ul>
<li>Quantitative Data Exploratory</li>
<ul><li>Correlation, Coefficients, P-values</li></ul>
<li>Testing Hypothesis, ANOVA</li>
<ul><li>Chisquare, ANOVA, Normal-test, Z-test, Pearson Correlation</li></ul>
<li>Summary and Conclusion</li>
<li>References</li>
</ol>

### Questions

### Importing and Reading libraries and data

In [185]:
# Import modules
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
import plotly.graph_objs as go 
from plotly.offline import init_notebook_mode,iplot

# filter warnings
import warnings
warnings.filterwarnings("ignore", category=FutureWarning)

init_notebook_mode(connected=True)

In [186]:
# Loading Data
df = pd.read_csv('data/data_house.csv')                     # our main data for housing

spending_df = pd.read_csv('data/data_spending.csv')         # need 1 column of spending per state
gdp_df = pd.read_csv('data/data_gdp.csv')                   # need 1 column of gdp per state
population_df = pd.read_csv('data/data_population.csv')     # need 1 column of population per state
income_df = pd.read_csv('data/data_income.csv')             # need 1 column of income per state

In [187]:
df.shape

(85509, 8)

In [188]:
# Reading the housing data
df.info()
df.tail()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85509 entries, 0 to 85508
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Price        85509 non-null  object
 1   Address      85509 non-null  object
 2   Bedrooms     64999 non-null  object
 3   Bathrooms    69439 non-null  object
 4   Size         73698 non-null  object
 5   Sale Status  69960 non-null  object
 6   URL          85509 non-null  object
 7   Raw Price    85509 non-null  float64
dtypes: float64(1), object(7)
memory usage: 5.2+ MB

,Price,Address,Bedrooms,Bathrooms,Size,Sale Status,URL,Raw Price
85504,"$79,000,000","2 Park Pl, New York, NY 10007",NaN,1 ba,"9,680 sqft",Condo for sale,https://www.zillow.com/homedetails/2-Park-Pl-N...,79000000.0
85505,"$90,000,000","432 Park Ave #82, New York, NY 10022",6 bds,8 ba,"8,054 sqft",Condo for sale,https://www.zillow.com/homedetails/432-Park-Av...,90000000.0
85506,"$95,000,000","1441 Angelo Dr, Los Angeles, CA 90210",NaN,NaN,NaN,Lot / Land for sale,https://www.zillow.com/homedetails/1441-Angelo...,95000000.0
85507,"$99,000,000","908 Bel Air Rd, Los Angeles, CA 90077",9 bds,20 ba,"34,000 sqft",House for sale,https://www.zillow.com/homedetails/908-Bel-Air...,99000000.0
85508,"$110,000,000","30 Beverly Park Ter, Beverly Hills, CA 90210",8 bds,12 ba,-- sqft,House for sale,https://www.zillow.com/homedetails/30-Beverly-...,110000000.0

### Functions and Lambda

In [189]:
# drop NaN, Price, URL, and assign to df1
def metric_deletion(x):
    x.dropna(axis='rows',inplace=True)
    x = x[x.Bedrooms != '-- bds']
    x = x[x.Bathrooms != '-- ba']
    x = x[x.Size != '-- sqft']
    x.drop(['URL', 'Price'], axis=1,inplace=True)
    return x
df1 = metric_deletion(df)
df1.head()

,Address,Bedrooms,Bathrooms,Size,Sale Status,Raw Price
5,"3515 W Thompson Rd, Indianapolis, IN 46217",2 bds,1 ba,814 sqft,House for sale,1.0
53,"3713 Hillside Ave, Indianapolis, IN 46218",2 bds,1 ba,"1,728 sqft",House for sale,775.0
65,"1337 W Livingston St APT 1, Allentown, PA 18102",3 bds,1 ba,"1,000 sqft",House for sale,1050.0
70,"1788 Westwood Dr, Troy, MI 48083",3 bds,2 ba,"1,418 sqft",House for sale,1600.0
72,"390 Rosado Springs St, Henderson, NV 89014",2 bds,2 ba,"1,060 sqft",Townhouse for sale,1700.0

In [190]:
# Converting Bathrooms into float
df1.Bathrooms = df1.Bathrooms.str.replace(' ba','').astype('float')
# Converting Bedrooms into float
df1.Bedrooms = df1.Bedrooms.str.replace(' bds','').astype('float')

In [191]:
# Converting Size to float
def filt_size(s):
    s= s.replace(',','')
    s =s.replace(' sqft','')
    return float(s)
df1.Size = df1.Size.apply(filt_size)

In [192]:
# Spliting Address into Street, City, State, ZipCode, and drop the Address
df1.Address = df1.Address.astype('str')
df1['Street']= df1.Address.apply(lambda x: x.split(', ')[0])
df1['City']= df1.Address.apply(lambda x: x.split(', ')[1])
df1['State']= df1.Address.apply(lambda x: (x.split(', ')[-1]).split(' ')[0])
df1['ZipCode']= df1.Address.apply(lambda x: (x.split(', ')[-1]).split(' ')[1])
# Assign to df2
df2 = df1.drop(['Address'],axis=1)
# Reset the index
df2.reset_index(inplace=True,drop=True)
df2.head()

,Bedrooms,Bathrooms,Size,Sale Status,Raw Price,Street,City,State,ZipCode
0,2.0,1.0,814.0,House for sale,1.0,3515 W Thompson Rd,Indianapolis,IN,46217
1,2.0,1.0,1728.0,House for sale,775.0,3713 Hillside Ave,Indianapolis,IN,46218
2,3.0,1.0,1000.0,House for sale,1050.0,1337 W Livingston St APT 1,Allentown,PA,18102
3,3.0,2.0,1418.0,House for sale,1600.0,1788 Westwood Dr,Troy,MI,48083
4,2.0,2.0,1060.0,Townhouse for sale,1700.0,390 Rosado Springs St,Henderson,NV,89014

### Cleaning Data

In [193]:
# Found two rows of abnormal values, so found exact address on google and replace with the right values
df2.loc[28709:28711, 'State']= 'AZ'
df2.loc[28709:28711, 'ZipCode']= '85260'

In [194]:
# Converting the columns as strings for further cleaning
df2[['Street','City','State','ZipCode']].astype('str')

                           Street          City State ZipCode
0              3515 W Thompson Rd  Indianapolis    IN   46217
1               3713 Hillside Ave  Indianapolis    IN   46218
2      1337 W Livingston St APT 1     Allentown    PA   18102
3                1788 Westwood Dr          Troy    MI   48083
4           390 Rosado Springs St     Henderson    NV   89014
...                           ...           ...   ...     ...
45394  111 W 57th St PENTHOUSE 72      New York    NY   10019
45395              0 Del Valle Rd     Livermore    CA   94550
45396           1060 Brooklawn Dr   Los Angeles    CA   90077
45397            432 Park Ave #82      New York    NY   10022
45398              908 Bel Air Rd   Los Angeles    CA   90077

[45399 rows x 4 columns]

In [195]:
# Finding the weird ZipCode, it is in Canada
df2.loc[df2.ZipCode == 'N9V']

,Bedrooms,Bathrooms,Size,Sale Status,Raw Price,Street,City,State,ZipCode
38379,4.0,4.0,2800.0,House for sale,865000.0,349 Benson Ct,Amherstburg,ON,N9V

In [196]:
# Dropping the row
df2.drop(df2.iloc[38379].name,inplace=True)

In [197]:
# Now the ZipCode can be converted to Integer
df2.ZipCode = df2.ZipCode.astype('int')

In [198]:
#convert Sale Status into house Types
house_status = list(df2['Sale Status'].unique())

In [199]:
# Make a list of house types
house_type = ['House','Townhouse','Multifamily', 'Condo', 'Others', 'Apartment']
# Replacing house_status with house_type
df2['Sale Status'] = df2['Sale Status'].map(dict(zip(house_status,house_type)))
df2.rename(columns={"Sale Status": "Type"}, inplace=True)

In [200]:
# Street column is not useful so we drop it
df3 = df2.drop(['Street'], axis=1)

In [201]:
# Change Raw Price column name to Price, create perSqft column
df3.rename(columns={"Raw Price":"Price"}, inplace=True)
df3['perSqFt'] = df3.Price / df3.Size

In [202]:
# Due to previously dropping rows, reset index again
# West Virginia and Wyoming not in data
df3 = df3.reset_index(drop=True)
len(df3.State.unique())

48

In [203]:
# Assign Regions, also need to drop Wyoming and West Virgina since the dataset does not contain 
# listings for that certain State in the initial DataFrame 
west = ['CA', 'NV', 'AK', 'WA' , 'OR', 'ID', 'MT', 'UT', 'CO', 'AZ', 'NM', 'HI']
midwest = ['ND', 'WI','SD', 'NE', 'KS', 'MN', 'IA', 'MO', 'IL', 'IN', 'OH','MI']
north = ['PA', 'NY', 'NH', 'MA', 'CT', 'ME', 'DC', 'NJ', 'RI']
south = ['TX', 'OK', 'AR', 'LA', 'MS', 'AL', 'TN', 'KY', 'VA', 'MD', 'DE', 'NC', 'SC', 'GA', 'FL']
full_state_list = west + midwest + north + south

# Creating function to assign regions
def find_region(state):
    if state in west:
        state = 'West'
    elif state in north:
        state = 'North'
    elif state in south:
        state = 'South'
    elif state in midwest:
        state = 'MidWest'
    return state

# Create Region column
df3['Region'] = df3.State.apply(find_region)

In [204]:
#Display the list of full_state_list in order to compare with the DataFrame state column in order to sort missing , 
full_state_list.sort()
full_state_list
#Converted numpy.Array into a list in order to compare with the list above.
comparator = df3['State'].unique().tolist()
comparator.sort()
comparator
compare_dict = dict(zip(full_state_list,comparator))
compare_dict
# Check our list of states and dataframe states are in sync
# df3 is fully cleaned, now we are making a "state_df"

{'AK': 'AK',
 'AL': 'AL',
 'AR': 'AR',
 'AZ': 'AZ',
 'CA': 'CA',
 'CO': 'CO',
 'CT': 'CT',
 'DC': 'DC',
 'DE': 'DE',
 'FL': 'FL',
 'GA': 'GA',
 'HI': 'HI',
 'IA': 'IA',
 'ID': 'ID',
 'IL': 'IL',
 'IN': 'IN',
 'KS': 'KS',
 'KY': 'KY',
 'LA': 'LA',
 'MA': 'MA',
 'MD': 'MD',
 'ME': 'ME',
 'MI': 'MI',
 'MN': 'MN',
 'MO': 'MO',
 'MS': 'MS',
 'MT': 'MT',
 'NC': 'NC',
 'ND': 'ND',
 'NE': 'NE',
 'NH': 'NH',
 'NJ': 'NJ',
 'NM': 'NM',
 'NV': 'NV',
 'NY': 'NY',
 'OH': 'OH',
 'OK': 'OK',
 'OR': 'OR',
 'PA': 'PA',
 'RI': 'RI',
 'SC': 'SC',
 'SD': 'SD',
 'TN': 'TN',
 'TX': 'TX',
 'UT': 'UT',
 'VA': 'VA',
 'WA': 'WA',
 'WI': 'WI'}

### Organizing Data

In [205]:
# Cleaned house data set to house_df
house_df = df3
house_df

,Bedrooms,Bathrooms,Size,Type,Price,City,State,ZipCode,perSqFt,Region
0,2.0,1.0,814.0,House,1.0,Indianapolis,IN,46217,0.001229,MidWest
1,2.0,1.0,1728.0,House,775.0,Indianapolis,IN,46218,0.448495,MidWest
2,3.0,1.0,1000.0,House,1050.0,Allentown,PA,18102,1.050000,North
3,3.0,2.0,1418.0,House,1600.0,Troy,MI,48083,1.128350,MidWest
4,2.0,2.0,1060.0,Townhouse,1700.0,Henderson,NV,89014,1.603774,West
...,...,...,...,...,...,...,...,...,...,...
45393,4.0,6.0,7130.0,Condo,66000000.0,New York,NY,10019,9256.661992,North
45394,4.0,2.0,2500.0,House,68000000.0,Livermore,CA,94550,27200.000000,West
45395,13.0,17.0,15011.0,House,75000000.0,Los Angeles,CA,90077,4996.336020,West
45396,6.0,8.0,8054.0,Condo,90000000.0,New York,NY,10022,11174.571641,North
45397,9.0,20.0,34000.0,House,99000000.0,Los Angeles,CA,90077,2911.764706,West

In [206]:
# Read gdp_df
gdp_df.head()

   Unnamed: 0  GeoFips        GeoName        2020
0           0        0  United States  18384687.0
1           1     1000        Alabama    196906.1
2           2     2000         Alaska     50161.0
3           3     4000        Arizona    320550.6
4           4     5000       Arkansas    114943.5

In [207]:
# Checking the States in gdp_df
gdp_df.GeoName.unique()

array(['United States', 'Alabama', 'Alaska', 'Arizona', 'Arkansas',
       'California', 'Colorado', 'Connecticut', 'Delaware',
       'District of Columbia', 'Florida', 'Georgia', 'Hawaii', 'Idaho',
       'Illinois', 'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana',
       'Maine', 'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon',
       'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming', 'New England', 'Mideast',
       'Great Lakes', 'Plains', 'Southeast', 'Southwest',
       'Rocky Mountain', 'Far West'], dtype=object)

In [208]:
# Drop the non-used States/Regions, converting column names, reset column index
gdp_df = gdp_df[(gdp_df.GeoName != 'United States') & (gdp_df.GeoName != 'Southwest') & (gdp_df.GeoName != 'Southeast') & (gdp_df.GeoName != 'Plains') & (gdp_df.GeoName != 'Mideast') & (gdp_df.GeoName != 'Great Lakes') & (gdp_df.GeoName != 'Rocky Mountain') & (gdp_df.GeoName != 'Far West') & (gdp_df.GeoName != 'District of Columbia') & (gdp_df.GeoName != 'New England') & (gdp_df.GeoName != 'West Virginia') & (gdp_df.GeoName != 'Wyoming')]
gdp_df.rename(columns={'GeoName':'State','2020':'GDP'},inplace=True)
gdp_df = gdp_df[['State', 'GDP']]
gdp_df.reset_index(inplace=True,drop=True)
gdp_df

             State        GDP
0          Alabama   196906.1
1           Alaska    50161.0
2          Arizona   320550.6
3         Arkansas   114943.5
4       California  2663665.9
5         Colorado   346011.3
6      Connecticut   235888.6
7         Delaware    62056.2
8          Florida   944000.8
9          Georgia   536693.0
10          Hawaii    70625.2
11           Idaho    73655.4
12        Illinois   737643.6
13         Indiana   329863.3
14            Iowa   169420.3
15          Kansas   156770.1
16        Kentucky   185535.1
17       Louisiana   222296.8
18           Maine    58757.3
19        Maryland   353052.5
20   Massachusetts   498577.0
21        Michigan   445682.6
22       Minnesota   326635.6
23     Mississippi    99667.5
24        Missouri   282654.2
25         Montana    46158.1
26        Nebraska   117664.9
27          Nevada   145219.1
28   New Hampshire    75543.1
29      New Jersey   535794.9
30      New Mexico    92696.5
31        New York  1420141.0
32  North Carolina   499517.5
33    North Dakota    54581.1
34            Ohio   589897.7
35        Oklahoma   190893.8
36          Oregon   212849.7
37    Pennsylvania   683773.9
38    Rhode Island    51415.1
39  South Carolina   208480.5
40    South Dakota    46682.7
41       Tennessee   316325.3
42           Texas  1734321.1
43            Utah   171370.1
44         Vermont    28648.5
45        Virginia   473817.5
46      Washington   532861.9
47       Wisconsin   291715.8

In [209]:
# Read population_df
population_df.head()

,rank,State,Pop,Growth,Pop2018,Pop2010,growthSince2010,Percent,density
0,1,California,39613493,0.0038,39461588,37319502,0.0615,0.1184,254.2929
1,2,Texas,29730311,0.0385,28628666,25241971,0.1778,0.0889,113.8081
2,3,Florida,21944577,0.0330,21244317,18845537,0.1644,0.0656,409.2229
3,4,New York,19299981,-0.0118,19530351,19399878,-0.0051,0.0577,409.5400
4,5,Pennsylvania,12804123,0.0003,12800922,12711160,0.0073,0.0383,286.1704

In [210]:
# Checking states in population_df
population_df.State.unique()

array(['California', 'Texas', 'Florida', 'New York', 'Pennsylvania',
       'Illinois', 'Ohio', 'Georgia', 'North Carolina', 'Michigan',
       'New Jersey', 'Virginia', 'Washington', 'Arizona', 'Tennessee',
       'Massachusetts', 'Indiana', 'Missouri', 'Maryland', 'Colorado',
       'Wisconsin', 'Minnesota', 'South Carolina', 'Alabama', 'Louisiana',
       'Kentucky', 'Oregon', 'Oklahoma', 'Connecticut', 'Utah',
       'Puerto Rico', 'Nevada', 'Iowa', 'Arkansas', 'Mississippi',
       'Kansas', 'New Mexico', 'Nebraska', 'Idaho', 'West Virginia',
       'Hawaii', 'New Hampshire', 'Maine', 'Montana', 'Rhode Island',
       'Delaware', 'South Dakota', 'North Dakota', 'Alaska',
       'District of Columbia', 'Vermont', 'Wyoming'], dtype=object)

In [211]:
# Filter out some regions and states, Grabbing State and Pop columns, reset index
population_df = population_df[(population_df.State != 'Wyoming') & (population_df.State != 'West Virginia') & (population_df.State != 'District of Columbia') & (population_df.State != 'Puerto Rico')]
population_df = population_df[['State','Pop']]
population_df.sort_values(by=['State'],inplace=True)
population_df.reset_index(inplace=True,drop=True)
population_df

             State       Pop
0          Alabama   4934193
1           Alaska    724357
2          Arizona   7520103
3         Arkansas   3033946
4       California  39613493
5         Colorado   5893634
6      Connecticut   3552821
7         Delaware    990334
8          Florida  21944577
9          Georgia  10830007
10          Hawaii   1406430
11           Idaho   1860123
12        Illinois  12569321
13         Indiana   6805663
14            Iowa   3167974
15          Kansas   2917224
16        Kentucky   4480713
17       Louisiana   4627002
18           Maine   1354522
19        Maryland   6065436
20   Massachusetts   6912239
21        Michigan   9992427
22       Minnesota   5706398
23     Mississippi   2966407
24        Missouri   6169038
25         Montana   1085004
26        Nebraska   1951996
27          Nevada   3185786
28   New Hampshire   1372203
29      New Jersey   8874520
30      New Mexico   2105005
31        New York  19299981
32  North Carolina  10701022
33    North Dakota    770026
34            Ohio  11714618
35        Oklahoma   3990443
36          Oregon   4289439
37    Pennsylvania  12804123
38    Rhode Island   1061509
39  South Carolina   5277830
40    South Dakota    896581
41       Tennessee   6944260
42           Texas  29730311
43            Utah   3310774
44         Vermont    623251
45        Virginia   8603985
46      Washington   7796941
47       Wisconsin   5852490

In [212]:
income_df.head()

   GeoFips        GeoName        2020
0        0  United States  19607447.0
1     1000        Alabama    228748.8
2     2000       Alaska *     46430.3
3     4000        Arizona    368458.6
4     5000       Arkansas    143147.9

In [213]:
# Check GeoName/States
income_df.GeoName.unique()

array(['United States', 'Alabama', 'Alaska *', 'Arizona', 'Arkansas',
       'California', 'Colorado', 'Connecticut', 'Delaware',
       'District of Columbia', 'Florida', 'Georgia', 'Hawaii *', 'Idaho',
       'Illinois', 'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana',
       'Maine', 'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon',
       'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming', 'New England', 'Mideast',
       'Great Lakes', 'Plains', 'Southeast', 'Southwest',
       'Rocky Mountain', 'Far West'], dtype=object)

In [214]:
# Drop unused States/Region, rename GeoName to State and 2020 to income, filter out other columns, reset index
income_df = income_df[(income_df.GeoName != 'United States') & (income_df.GeoName != 'Southwest') & (income_df.GeoName != 'Southeast') & (income_df.GeoName != 'Plains') & (income_df.GeoName != 'Mideast') & (income_df.GeoName != 'Great Lakes') & (income_df.GeoName != 'Rocky Mountain') & (income_df.GeoName != 'Far West') & (income_df.GeoName != 'District of Columbia') & (income_df.GeoName != 'New England') & (income_df.GeoName != 'West Virginia') & (income_df.GeoName != 'Wyoming')]
income_df.rename(columns={'GeoName':'State','2020':'income'},inplace=True)
income_df = income_df[['State', 'income']]
income_df.reset_index(inplace=True,drop=True)

# we found astrious * in States so we made a function to remove it
def conv_state(a):
    if '*' in a:
        a=a.replace(' *', '')
    return a

# we need to convert to string to run the function
income_df.State.astype('string')
income_df.State = income_df.State.apply(conv_state)
income_df

             State     income
0          Alabama   228748.8
1           Alaska    46430.3
2          Arizona   368458.6
3         Arkansas   143147.9
4       California  2763312.0
5         Colorado   370392.1
6      Connecticut   279612.4
7         Delaware    55357.4
8          Florida  1209995.9
9          Georgia   554566.5
10          Hawaii    82527.3
11           Idaho    89077.7
12        Illinois   792135.5
13         Indiana   350759.5
14            Iowa   169181.6
15          Kansas   163462.2
16        Kentucky   211947.6
17       Louisiana   236327.2
18           Maine    73192.8
19        Maryland   404520.7
20   Massachusetts   540855.3
21        Michigan   530808.6
22       Minnesota   350784.7
23     Mississippi   124988.2
24        Missouri   318019.1
25         Montana    57660.2
26        Nebraska   111545.0
27          Nevada   168587.3
28   New Hampshire    91673.1
29      New Jersey   652498.9
30      New Mexico    97603.5
31        New York  1440049.5
32  North Carolina   533269.3
33    North Dakota    47089.3
34            Ohio   627231.3
35        Oklahoma   198552.1
36          Oregon   238847.1
37    Pennsylvania   788725.2
38    Rhode Island    64299.9
39  South Carolina   250573.6
40    South Dakota    52920.7
41       Tennessee   351546.3
42           Texas  1618635.1
43            Utah   169656.3
44         Vermont    36894.2
45        Virginia   532256.2
46      Washington   516441.1
47       Wisconsin   324252.0

In [215]:
# Reading spending_df
spending_df.head(15)

,Unnamed: 0,GeoFips,GeoName,LineCode,Description,2020
0,0,0,United States,1,Personal consumption expenditures,14047565.0
1,1,0,United States,2,Goods,4653822.0
2,2,0,United States,3,Durable goods,1616408.0
3,3,0,United States,4,Motor vehicles and parts,541265.0
4,4,0,United States,5,Furnishings and durable household equipment,390382.0
5,5,0,United States,6,Recreational goods and vehicles,476217.0
6,6,0,United States,7,Other durable goods,208545.0
7,7,0,United States,8,Nondurable goods,3037413.0
8,8,0,United States,9,Food and beverages purchased for off-pre...,1146676.0
9,9,0,United States,10,Clothing and footwear,362435.0
10,10,0,United States,11,Gasoline and other energy goods,246757.0
11,11,0,United States,12,Other nondurable goods,1281545.0
12,12,0,United States,13,Services,9393744.0
13,13,0,United States,14,Household consumption expenditures (for se...,8872868.0
14,14,0,United States,15,Housing and utilities,2668144.0

In [216]:
# Personal consumption expenditure is the total of the sub categories, so we only want the total per state
spending_df = spending_df[spending_df['Description'] == 'Personal consumption expenditures']

# Dropping un-used region/State
spending_df = spending_df[(spending_df.GeoName != 'United States') & (spending_df.GeoName != 'Southwest') & (spending_df.GeoName != 'Southeast') & (spending_df.GeoName != 'Plains') & (spending_df.GeoName != 'Mideast') & (spending_df.GeoName != 'Great Lakes') & (spending_df.GeoName != 'Rocky Mountain') & (spending_df.GeoName != 'Far West') & (spending_df.GeoName != 'District of Columbia') & (spending_df.GeoName != 'New England') & (spending_df.GeoName != 'West Virginia') & (spending_df.GeoName != 'Wyoming')]

# Rename column names
spending_df.rename(columns={'GeoName':'State','2020':'spending'},inplace=True)

# Filter out needed columns
spending_df = spending_df[['State', 'spending']]

# Reset index
spending_df.reset_index(inplace=True,drop=True)
spending_df

             State   spending
0          Alabama   176479.8
1           Alaska    35635.7
2          Arizona   287090.1
3         Arkansas   104488.8
4       California  1835980.6
5         Colorado   270883.0
6      Connecticut   179405.9
7         Delaware    44834.5
8          Florida   947905.9
9          Georgia   408752.8
10          Hawaii    63427.5
11           Idaho    64780.6
12        Illinois   553611.6
13         Indiana   257343.1
14            Iowa   118904.6
15          Kansas   113185.3
16        Kentucky   163749.9
17       Louisiana   173521.0
18           Maine    61123.8
19        Maryland   268456.8
20   Massachusetts   358472.3
21        Michigan   411364.2
22       Minnesota   251204.7
23     Mississippi    95998.3
24        Missouri   246053.1
25         Montana    45719.5
26        Nebraska    79713.9
27          Nevada   123053.7
28   New Hampshire    70718.9
29      New Jersey   446078.4
30      New Mexico    74276.4
31        New York   961707.3
32  North Carolina   405953.5
33    North Dakota    33631.3
34            Ohio   466159.7
35        Oklahoma   137469.2
36          Oregon   178375.4
37    Pennsylvania   570772.0
38    Rhode Island    45397.1
39  South Carolina   195958.7
40    South Dakota    37337.8
41       Tennessee   258252.3
42           Texas  1164466.4
43            Utah   121445.4
44         Vermont    29544.8
45        Virginia   367302.7
46      Washington   354219.1
47       Wisconsin   238923.0

In [217]:
# Making a merge_df and merge all the data by state
merged_df = gdp_df.merge(spending_df, how = 'inner', on = 'State')
merged_df = merged_df.merge(population_df, how = 'inner', on = 'State')
merged_df = merged_df.merge(income_df, how = 'inner', on = 'State')

# Renaming columns, renaming to fullState is because we will insert abbreviations later, and merge with future data.
merged_df.rename(columns={'State':'fullState','spending':'Spending', 'Pop':'Population', 'income': 'Income'},inplace=True)
merged_df.head()

    fullState        GDP   Spending  Population     Income
0     Alabama   196906.1   176479.8     4934193   228748.8
1      Alaska    50161.0    35635.7      724357    46430.3
2     Arizona   320550.6   287090.1     7520103   368458.6
3    Arkansas   114943.5   104488.8     3033946   143147.9
4  California  2663665.9  1835980.6    39613493  2763312.0

### Data Visualization

In [220]:
pd.set_option('display.float_format', '{:.2f}'.format)
pd.pivot_table(df3, values=['perSqFt'], index=['State'])

       perSqFt
State
AK      175.69
AL      136.81
AR      142.48
AZ      578.91
CA      498.29
CO      336.63
CT      212.42
DC      574.93
DE      147.46
FL      231.73
GA      154.64
HI     1133.03
IA       97.06
ID      269.87
IL      178.29
IN      112.11
KS      122.80
KY      197.18
LA      146.52
MA      610.23
MD      168.14
ME      477.70
MI      102.92
MN      226.40
MO      136.04
MS      101.42
MT      202.14
NC      248.81
ND      121.78
NE      152.47
NH      239.72
NJ     1474.06
NM      165.55
NV      240.31
NY      528.16
OH      105.99
OK      149.21
OR      285.81
PA      199.40
RI      207.28
SC      213.95
SD      166.50
TN      247.32
TX      146.90
UT      214.55
VA      332.91
WA      279.37
WI      180.49

In [218]:
#created a function that finds states with not enough data to produce analysis
def little_data_states(tab):
    little_info_state = []
    for x in full_state_list:
        if len(tab[tab['State'] == x]) < 30:
            little_info_state.append(x)
    return little_info_state

states_exempted= little_data_states(df3)

In [219]:
#created a new dataframe that would filter out these states from the df3 dataframe
df4 = df3[~df3['State'].isin(states_exempted)]
df4

,Bedrooms,Bathrooms,Size,Type,Price,City,State,ZipCode,perSqFt,Region
0,2.0,1.0,814.0,House,1.0,Indianapolis,IN,46217,0.001229,MidWest
1,2.0,1.0,1728.0,House,775.0,Indianapolis,IN,46218,0.448495,MidWest
2,3.0,1.0,1000.0,House,1050.0,Allentown,PA,18102,1.050000,North
3,3.0,2.0,1418.0,House,1600.0,Troy,MI,48083,1.128350,MidWest
4,2.0,2.0,1060.0,Townhouse,1700.0,Henderson,NV,89014,1.603774,West
...,...,...,...,...,...,...,...,...,...,...
45393,4.0,6.0,7130.0,Condo,66000000.0,New York,NY,10019,9256.661992,North
45394,4.0,2.0,2500.0,House,68000000.0,Livermore,CA,94550,27200.000000,West
45395,13.0,17.0,15011.0,House,75000000.0,Los Angeles,CA,90077,4996.336020,West
45396,6.0,8.0,8054.0,Condo,90000000.0,New York,NY,10022,11174.571641,North
45397,9.0,20.0,34000.0,House,99000000.0,Los Angeles,CA,90077,2911.764706,West

In [ ]:
'''
NOT WORKING CORRECTLY


data = dict(type = 'choropleth',colorscale='Portland',locations=df3['State'],locationmode='USA-states', z=df3['Price'],text=df3['Price'], colorbar={'title':'perSqFt'})
choromap = go.Figure(data = [data],layout = dict(geo = {'scope':'usa'}))

iplot(choromap,validate=False)
'''

In [ ]:
# for GeoPandas later use
# df2 = df2[df2['ZipCode'].between(10000,99999,inclusive='both')]

### Conclusion

In [ ]:
'''



'''

### References

In [ ]:
'''
References

Data of:    Housing Prices
https://www.kaggle.com/dataranch/zillow-1

Data of:    GDP,Income,Spending 
https://apps.bea.gov/iTable/iTable.cfm?reqid=70&step=1&isuri=1&acrdn=1#reqid=70&step=1&isuri=1&acrdn=1

Data of:    Population
https://worldpopulationreview.com/states


'''